console.log("Завдання 4");

const companies = [
  {
    companyName: "INGO",
    companyDescription:
      "Страхова компанія «Інго» (раніше «Інго Україна») має 25-річний досвід роботи на ринку. Стабільно займаючи лідируючі позиції за сумами виплат страхових відшкодувань, компанія входить до групи найбільших страхових організацій України за обсягом премій та величиною власних активів.",
    companySite: "https://ingo.ua/",
    name: "Франшиза 0  Зона 1 для В1,В5",
    description: "Франшиза 0  Зона 1 для В1,В5",
    franchise: 0,
    costs: 2361,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК Універсальна",
    companyDescription:
      "Страхова компанія «Універсальна» була створена у 1991 році",
    companySite: "www.universalna.com",
    name: "Зона 1  франшиза 0  без С, Е, D  без льгот",
    description: "Зона 1  франшиза 0  без С, Е, D  без льгот ",
    franchise: 0,
    costs: 2935,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "НАСК Оранта",
    companyDescription:
      "НАСК «Оранта» є правонаступницею Укрдержстраху, заснованого 25 листопада 1921 року. Компанія стала приватною, що сприяло подальшому поліпшенню структури активів НАСК «Оранта» і підвищенню її платоспроможності.",
    companySite: "http://www.oranta.ua",
    name: "Франшиза 0 физ. лица , не такси ,зона 1 без льгот",
    description: "Франшиза 0 физ. лица , не такси ,зона 1 без льгот ",
    franchise: 0,
    costs: 2738,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК Універсальна",
    companyDescription:
      "Страхова компанія «Універсальна» була створена у 1991 році",
    companySite: "www.universalna.com",
    name: "Зона 1 франшиза 3200  без С,D,Е без льгот",
    description: "Зона 1 франшиза 3200  без С,D,Е  без льгот ",
    franchise: 3200,
    costs: 2190,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: 'ПрАТ СК  "ПЗУ Україна"',
    companyDescription:
      "PZU входить до десятки кращих страхових компаній України.\n" +
      "За оцінками всесвітнього рейтингового агентства «Standard & Poor's» Група PZU має високу оцінку фінансової стійкості - «А» (зі стабільною перспективою).\n" +
      "Валові платежі за 2015р склали 799 млн гривень.\n" +
      "Валові виплати склали 236 млн гривень.",
    companySite: "http://www.pzu.com.ua/",
    name: "ПЗУ франшиза 2500",
    description: "Франшиза 2500  для В1,2,3,4,А ,F  зона 1",
    franchise: 2500,
    costs: 1840,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК UNIQA",
    companyDescription:
      "Страхова компанія «УНІКА» ( раніше «Кред-Класик»), входить до складу UNIQA Group (Австрія).\n" +
      "UNIQA Group Austria - одна з провідних страхових груп Центральної Європи, лідер австрійського ринку страхування.\n" +
      "Валові платежі за 2015р склали понад 1 млрд гривень.\n" +
      "Валові виплати склали 426 млн гривень.",
    companySite: "http://www.uniqa.ua/",
    name: "Франшиза 2500 Зона 1 для В1",
    description: "Франшиза 2500 Зона 1 для В1",
    franchise: 2500,
    costs: 2281,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: 'ПАТ "СК "УСГ"',
    companyDescription: 'ПАТ "СК "УСГ"',
    companySite: "https://ukringroup.ua/ua",
    name: "ТЕСТОВА ПРОГРАМА",
    description: "ТЕСТОВА ПРОГРАМА",
    franchise: 3200,
    costs: 1776,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "УТСК",
    companyDescription:
      "ПрАТ «Українська транспортна страхова компанія.», УТСК або UTICO – динамічна компанія, що працює 25 рік на страховому ринку України. Ми надаємо своїм клієнтам повний комплекс страхових послуг, виходячи з їх потреб та вподобань. ",
    companySite: "https://www.utico.ua/",
    name: "Франшиза 0 ,  зона 1 для В1,В4,В5,F, А1,2,С1",
    description: "Франшиза 0 , зона  1 для В1,В4,В5,F, А1,2,С1",
    franchise: 0,
    costs: 2053,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: 'ПАТ "СК "УСГ"',
    companyDescription: 'ПАТ "СК "УСГ"',
    companySite: "https://ukringroup.ua/ua",
    name: "Франшиза 0 Зона 1 для В1",
    description: "Франшиза 0 Зона 1 для В1",
    franchise: 0,
    costs: 2281,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "ARX",
    companyDescription:
      "ПАТ «Страхова компанія «АХА Страхування» - один з лідерів на ринку ризикового страхування України. Входить до французької Групи AXA.\n" +
      "Сьомий рік поспіль AXA – страховий бренд №1 у світі.\n" +
      "Валові платежі за 2015р - 1,09 млрд гривень.\n" +
      "Валові виплати за 2015 р - 490 млн гривень.",
    companySite: "https://arx.com.ua",
    name: "В1 франшиза 0 зона 1",
    description: "В1 франшиза 0 зона 1",
    franchise: 0,
    costs: 3422,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: 'ПрАТ СК  "ПЗУ Україна"',
    companyDescription:
      "PZU входить до десятки кращих страхових компаній України.\n" +
      "За оцінками всесвітнього рейтингового агентства «Standard & Poor's» Група PZU має високу оцінку фінансової стійкості - «А» (зі стабільною перспективою).\n" +
      "Валові платежі за 2015р склали 799 млн гривень.\n" +
      "Валові виплати склали 236 млн гривень.",
    companySite: "http://www.pzu.com.ua/",
    name: "ПЗУ франшиза 3200  зона 1",
    description: " ПЗУ франшиза 3200  зона 1",
    franchise: 3200,
    costs: 1521,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК UNIQA",
    companyDescription:
      "Страхова компанія «УНІКА» ( раніше «Кред-Класик»), входить до складу UNIQA Group (Австрія).\n" +
      "UNIQA Group Austria - одна з провідних страхових груп Центральної Європи, лідер австрійського ринку страхування.\n" +
      "Валові платежі за 2015р склали понад 1 млрд гривень.\n" +
      "Валові виплати склали 426 млн гривень.",
    companySite: "http://www.uniqa.ua/",
    name: "Копия Копия Тестова. Для перевірки програми. ",
    description: "Копия Копия Тестова. Для перевірки програми. ",
    franchise: 3200,
    costs: 3711,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК Княжа",
    companyDescription:
      "Страхова компанія «Княжа Вієнна Іншуранс Груп» – це надійна страхова компанія загальнонаціонального масштабу, яка постійно розвивається та працює на страховому ринку України з 1997 року, а з 2005 року – входить до складу потужної європейської фінансової структури Vienna Insurance Group",
    companySite: "http://kniazha.com.ua",
    name: "Франшиза 0",
    description: "Франшиза 0 Зона 1 для В1,2,3 ,А, F",
    franchise: 0,
    costs: 2738,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "УТСК",
    companyDescription:
      "ПрАТ «Українська транспортна страхова компанія.», УТСК або UTICO – динамічна компанія, що працює 25 рік на страховому ринку України. Ми надаємо своїм клієнтам повний комплекс страхових послуг, виходячи з їх потреб та вподобань. ",
    companySite: "https://www.utico.ua/",
    name: "Франшиза 0 ,  зона 1 для В1,В4,В5,F, А1,2,С1",
    description: "Франшиза 0 , зона  1 для В1,В4,В5,F, А1,2,С1",
    franchise: 0,
    costs: 2053,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: 'ПАТ "СК "УСГ"',
    companyDescription: 'ПАТ "СК "УСГ"',
    companySite: "https://ukringroup.ua/ua",
    name: "Франшиза 2600 Зона 1 для В1",
    description: "Франшиза 2600 Зона 1 для В1",
    franchise: 2600,
    costs: 1880,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СГ ТАС",
    companyDescription:
      "СГ « ТАС » - універсальний страховик , який пропонує споживачам понад 80 страхових продуктів з різних видів добровільного та обов'язкового страхування.\n" +
      "Валових платежів за 2015р зібрано понад 600 млн гривень. Валові виплати склали 212 млн гривень. ",
    companySite: "www.tas-insurance.com.ua",
    name: "Копия Копия ТАС. физ лица  Зона 1",
    description: "Франшиза 2500",
    franchise: 2500,
    costs: 2011,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СГ ТАС",
    companyDescription:
      "СГ « ТАС » - універсальний страховик , який пропонує споживачам понад 80 страхових продуктів з різних видів добровільного та обов'язкового страхування.\n" +
      "Валових платежів за 2015р зібрано понад 600 млн гривень. Валові виплати склали 212 млн гривень. ",
    companySite: "www.tas-insurance.com.ua",
    name: "ТАС. физ лица  Зона 1",
    description: "Франшиза 3200",
    franchise: 3200,
    costs: 2205,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК Універсальна",
    companyDescription:
      "Страхова компанія «Універсальна» була створена у 1991 році",
    companySite: "www.universalna.com",
    name: "Зона 1 франшиза 2500  без С,D,Е без льгот",
    description: "Зона 1 франшиза 2500  без С,D,Е  без льгот ",
    franchise: 2500,
    costs: 2312,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК UNIQA",
    companyDescription:
      "Страхова компанія «УНІКА» ( раніше «Кред-Класик»), входить до складу UNIQA Group (Австрія).\n" +
      "UNIQA Group Austria - одна з провідних страхових груп Центральної Європи, лідер австрійського ринку страхування.\n" +
      "Валові платежі за 2015р склали понад 1 млрд гривень.\n" +
      "Валові виплати склали 426 млн гривень.",
    companySite: "http://www.uniqa.ua/",
    name: "Копия Тестова. Для перевірки програми. ",
    description: "Копия Тестова. Для перевірки програми. ",
    franchise: 3200,
    costs: 2190,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК Княжа",
    companyDescription:
      "Страхова компанія «Княжа Вієнна Іншуранс Груп» – це надійна страхова компанія загальнонаціонального масштабу, яка постійно розвивається та працює на страховому ринку України з 1997 року, а з 2005 року – входить до складу потужної європейської фінансової структури Vienna Insurance Group",
    companySite: "http://kniazha.com.ua",
    name: "Франшиза 3200",
    description: "Франшиза 3200 Зона 1 для В1,2,3 ,А, F",
    franchise: 3200,
    costs: 1673,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "УТСК",
    companyDescription:
      "ПрАТ «Українська транспортна страхова компанія.», УТСК або UTICO – динамічна компанія, що працює 25 рік на страховому ринку України. Ми надаємо своїм клієнтам повний комплекс страхових послуг, виходячи з їх потреб та вподобань. ",
    companySite: "https://www.utico.ua/",
    name: "Франшиза 1500 , только зона 1 все тс",
    description: "Франшиза 1500 ,только зона 1 все тс",
    franchise: 1500,
    costs: 1742,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СГ ТАС",
    companyDescription:
      "СГ « ТАС » - універсальний страховик , який пропонує споживачам понад 80 страхових продуктів з різних видів добровільного та обов'язкового страхування.\n" +
      "Валових платежів за 2015р зібрано понад 600 млн гривень. Валові виплати склали 212 млн гривень. ",
    companySite: "www.tas-insurance.com.ua",
    name: "ТЕСТОВА ПРОГРАМА",
    description: "Програма тестова на проді немає. ",
    franchise: 3200,
    costs: 2205,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК Євроінс Україна",
    companyDescription:
      "Стратегія «СК «Євроінс Україна» передбачає діяльність в усіх секторах українського страхового ринку. Компанія має ліцензії на надання страхового захисту практично з усього спектру добровільного та обов’язкового страхування",
    companySite: "https://euroins.com.ua",
    name: "Франшиза 2500 Зона 1  все типы ТС без льгот",
    description: "Франшиза 2500",
    franchise: 2500,
    costs: 1889,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "ПрАТ «Європейський страховий альянс»",
    companyDescription:
      "За результатами оцінки діяльності страховиків – членів МТСБУ, ПрАТ  “Європейський страховий альянс” утримує високий рівень стійкості (зеленій колір).  ПрАТ  “Європейський страховий альянс” є учасником Угоди про пряме врегулювання збитків за договорами ОСЦПВ.",
    companySite: "https://eia.com.ua",
    name: " Європейський сттрахвий альянс",
    description: " Європейський сттрахвий альянс",
    franchise: 2500,
    costs: 2084,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "НАСК Оранта",
    companyDescription:
      "НАСК «Оранта» є правонаступницею Укрдержстраху, заснованого 25 листопада 1921 року. Компанія стала приватною, що сприяло подальшому поліпшенню структури активів НАСК «Оранта» і підвищенню її платоспроможності.",
    companySite: "http://www.oranta.ua",
    name: "Франшиза 2500 Зона 1 все ТС без льгот",
    description: "Франшиза 2500",
    franchise: 2500,
    costs: 2008,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "ARX",
    companyDescription:
      "ПАТ «Страхова компанія «АХА Страхування» - один з лідерів на ринку ризикового страхування України. Входить до французької Групи AXA.\n" +
      "Сьомий рік поспіль AXA – страховий бренд №1 у світі.\n" +
      "Валові платежі за 2015р - 1,09 млрд гривень.\n" +
      "Валові виплати за 2015 р - 490 млн гривень.",
    companySite: "https://arx.com.ua",
    name: "В1 франшиза 2500 зона 1",
    description: "В1 франшиза 2500 зона 1",
    franchise: 2500,
    costs: 2692,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "БРОКБІЗНЕС",
    companyDescription:
      "Страхова Компанія «БРОКБІЗНЕС» входить до переліку надійних компаній України, має 41 ліцензію і безперервний досвід роботи більше 29 років. З 1993 року ми придбали великий досвід і по праву займаємо значиме місце серед надійних і фінансово стабільних компаній на українському ринку страхування.",
    companySite: "https://bbs.ua/",
    name: "Тестова програма",
    description: "Тестова програма",
    franchise: 3200,
    costs: 2567,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: 'ПАТ "СК "УСГ"',
    companyDescription: 'ПАТ "СК "УСГ"',
    companySite: "https://ukringroup.ua/ua",
    name: "Франшиза 3200 Зона 1 для В1",
    description: "Франшиза 3200 Зона 1 для В1",
    franchise: 3200,
    costs: 1776,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК UNIQA",
    companyDescription:
      "Страхова компанія «УНІКА» ( раніше «Кред-Класик»), входить до складу UNIQA Group (Австрія).\n" +
      "UNIQA Group Austria - одна з провідних страхових груп Центральної Європи, лідер австрійського ринку страхування.\n" +
      "Валові платежі за 2015р склали понад 1 млрд гривень.\n" +
      "Валові виплати склали 426 млн гривень.",
    companySite: "http://www.uniqa.ua/",
    name: "Франшиза 0 Зона 1 без льгот для В1",
    description: "Франшиза 0 Зона 1  без льгот для В1",
    franchise: 0,
    costs: 3498,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК UNIQA",
    companyDescription:
      "Страхова компанія «УНІКА» ( раніше «Кред-Класик»), входить до складу UNIQA Group (Австрія).\n" +
      "UNIQA Group Austria - одна з провідних страхових груп Центральної Європи, лідер австрійського ринку страхування.\n" +
      "Валові платежі за 2015р склали понад 1 млрд гривень.\n" +
      "Валові виплати склали 426 млн гривень.",
    companySite: "http://www.uniqa.ua/",
    name: "Франшиза 1500 Зона 1 для В1",
    description: "Франшиза 1500 Зона 1 для В1 ",
    franchise: 1500,
    costs: 2662,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "УТСК",
    companyDescription:
      "ПрАТ «Українська транспортна страхова компанія.», УТСК або UTICO – динамічна компанія, що працює 25 рік на страховому ринку України. Ми надаємо своїм клієнтам повний комплекс страхових послуг, виходячи з їх потреб та вподобань. ",
    companySite: "https://www.utico.ua/",
    name: "Франшиза 2500 ,  зона 1 для В1,В4,В5,F, А1,2,С1",
    description: "Франшиза 2500 , зона  1 для В1,В4,В5,F, А1,2,С1",
    franchise: 2500,
    costs: 1680,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: 'ПрАТ СК  "ПЗУ Україна"',
    companyDescription:
      "PZU входить до десятки кращих страхових компаній України.\n" +
      "За оцінками всесвітнього рейтингового агентства «Standard & Poor's» Група PZU має високу оцінку фінансової стійкості - «А» (зі стабільною перспективою).\n" +
      "Валові платежі за 2015р склали 799 млн гривень.\n" +
      "Валові виплати склали 236 млн гривень.",
    companySite: "http://www.pzu.com.ua/",
    name: "ПЗУ франшиза 0 для В1 зона 1",
    description: "Франшиза 0  для В1 зона 1 ",
    franchise: 0,
    costs: 2616,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК ВУСО",
    companyDescription:
      "Страхова компанія « ВУСО » працює на українському страховому ринку з 2001 р. Клієнтами страхової компанії є понад 1000 юридичних осіб та 2 000 000 українських громадян.\n" +
      "Валові платежі за 2015р склали 250 млн гривень. \n" +
      "Валові виплати склали 49 млн гривень.",
    companySite: "www.vuso.ua",
    name: "Франшиза 2500 все ТС без льгот зона 1",
    description: "Франшиза 2500 полис",
    franchise: 2500,
    costs: 2341,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК ВУСО",
    companyDescription:
      "Страхова компанія « ВУСО » працює на українському страховому ринку з 2001 р. Клієнтами страхової компанії є понад 1000 юридичних осіб та 2 000 000 українських громадян.\n" +
      "Валові платежі за 2015р склали 250 млн гривень. \n" +
      "Валові виплати склали 49 млн гривень.",
    companySite: "www.vuso.ua",
    name: "Франшиза 0 все ТС без льгот зона 1",
    description: "Франшиза 0 полис",
    franchise: 0,
    costs: 3120,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "НАСК Оранта",
    companyDescription:
      "НАСК «Оранта» є правонаступницею Укрдержстраху, заснованого 25 листопада 1921 року. Компанія стала приватною, що сприяло подальшому поліпшенню структури активів НАСК «Оранта» і підвищенню її платоспроможності.",
    companySite: "http://www.oranta.ua",
    name: "Франшиза 1500 физ. лица , не такси ,зона 1 без льгот",
    description: "Франшиза 1500 физ. лица , не такси ,зона 1 без льгот ",
    franchise: 1500,
    costs: 2342,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК Євроінс Україна",
    companyDescription:
      "Стратегія «СК «Євроінс Україна» передбачає діяльність в усіх секторах українського страхового ринку. Компанія має ліцензії на надання страхового захисту практично з усього спектру добровільного та обов’язкового страхування",
    companySite: "https://euroins.com.ua",
    name: "Франшиза 1500 Зона 1  все типы ТС без льгот",
    description: "Франшиза 1500",
    franchise: 1500,
    costs: 2149,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК Євроінс Україна",
    companyDescription:
      "Стратегія «СК «Євроінс Україна» передбачає діяльність в усіх секторах українського страхового ринку. Компанія має ліцензії на надання страхового захисту практично з усього спектру добровільного та обов’язкового страхування",
    companySite: "https://euroins.com.ua",
    name: "Франшиза 0 Зона 1 все типы ТС без льгот",
    description: "Франшиза 0",
    franchise: 0,
    costs: 2697,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "УТСК",
    companyDescription:
      "ПрАТ «Українська транспортна страхова компанія.», УТСК або UTICO – динамічна компанія, що працює 25 рік на страховому ринку України. Ми надаємо своїм клієнтам повний комплекс страхових послуг, виходячи з їх потреб та вподобань. ",
    companySite: "https://www.utico.ua/",
    name: "Франшиза 1500 , только зона 1 все тс",
    description: "Франшиза 1500 ,только зона 1 все тс",
    franchise: 1500,
    costs: 1742,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК ВУСО",
    companyDescription:
      "Страхова компанія « ВУСО » працює на українському страховому ринку з 2001 р. Клієнтами страхової компанії є понад 1000 юридичних осіб та 2 000 000 українських громадян.\n" +
      "Валові платежі за 2015р склали 250 млн гривень. \n" +
      "Валові виплати склали 49 млн гривень.",
    companySite: "www.vuso.ua",
    name: "Франшиза 1500 все ТС без льгот зона 1",
    description: "Франшиза 1500 полис",
    franchise: 1500,
    costs: 2438,
    contractMonthes: "12 мiсяцiв",
  },
  {
    companyName: "СК Євроінс Україна",
    companyDescription:
      "Стратегія «СК «Євроінс Україна» передбачає діяльність в усіх секторах українського страхового ринку. Компанія має ліцензії на надання страхового захисту практично з усього спектру добровільного та обов’язкового страхування",
    companySite: "https://euroins.com.ua",
    name: "Франшиза 3200 Зона 1  все типы ТС без льгот",
    description: "Франшиза 3200",
    franchise: 3200,
    costs: 1793,
    contractMonthes: "12 мiсяцiв",
  },
];

function mergeCompanies(companies) {
  const mergedCompanies = companies.reduce((result, company) => {
    const existingCompany = result.find(
      (c) => c.companyName === company.companyName
    );
    if (existingCompany) {
      existingCompany.franchise.push(company.franchise);
      existingCompany.costs.push(company.costs);
      existingCompany.name.push(company.name);
      existingCompany.description.push(company.description);
    } else {
      result.push({
        ...company,
        franchise: [company.franchise],
        costs: [company.costs],
        name: [company.name],
        description: [company.description],
      });
    }
    return result;
  }, []);

  return mergedCompanies;
}

const mergedCompanies = mergeCompanies(companies);
console.log(mergedCompanies);
